renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx671/register_access/gnuc/iodefine.h
#define	GEN_DPFPU_DPFPUEX		GENIE0
#define	GEN_CAN0_ERS0			GENBE0
#define	GEN_CAN1_ERS1			GENBE0
#define	GEN_SCI0_TEI0			GENBL0
#define	GEN_SCI0_ERI0			GENBL0
#define	GEN_SCI1_TEI1			GENBL0
#define	GEN_SCI1_ERI1			GENBL0
#define	GEN_SCI2_TEI2			GENBL0
#define	GEN_SCI2_ERI2			GENBL0
#define	GEN_SCI3_TEI3			GENBL0
#define	GEN_SCI3_ERI3			GENBL0
#define	GEN_SCI4_TEI4			GENBL0
#define	GEN_SCI4_ERI4			GENBL0
#define	GEN_SCI5_TEI5			GENBL0
#define	GEN_SCI5_ERI5			GENBL0
#define	GEN_SCI6_TEI6			GENBL0
#define	GEN_SCI6_ERI6			GENBL0
#define	GEN_SCI7_TEI7			GENBL0
#define	GEN_SCI7_ERI7			GENBL0
#define	GEN_SCI12_TEI12			GENBL0
#define	GEN_SCI12_ERI12			GENBL0
#define	GEN_SCI12_SCIX0			GENBL0
#define	GEN_SCI12_SCIX1			GENBL0
#define	GEN_SCI12_SCIX2			GENBL0
#define	GEN_SCI12_SCIX3			GENBL0
#define	GEN_CAC_FERRI			GENBL0
#define	GEN_CAC_MENDI			GENBL0
#define	GEN_CAC_OVFI			GENBL0
#define	GEN_DOC_DOPCI			GENBL0
#define	GEN_SDHI_CDETI			GENBL1
#define	GEN_SDHI_CACI			GENBL1
#define	GEN_SDHI_SDACI			GENBL1
#define	GEN_POE3_OEI1			GENBL1
#define	GEN_POE3_OEI2			GENBL1
#define	GEN_POE3_OEI3			GENBL1
#define	GEN_POE3_OEI4			GENBL1
#define	GEN_RIIC0_TEI0			GENBL1
#define	GEN_RIIC0_EEI0			GENBL1
#define	GEN_RIIC2_TEI2			GENBL1
#define	GEN_RIIC2_EEI2			GENBL1
#define	GEN_SSIE0_SSIF0			GENBL1
#define	GEN_S12AD_S12CMPAI		GENBL1
#define	GEN_S12AD_S12CMPBI		GENBL1
#define	GEN_S12AD1_S12CMPAI1	GENBL1
#define	GEN_S12AD1_S12CMPBI1	GENBL1
#define	GEN_SCI8_TEI8			GENBL1
#define	GEN_SCI8_ERI8			GENBL1
#define	GEN_SCI9_TEI9			GENBL1
#define	GEN_SCI9_ERI9			GENBL1
#define	GEN_RIIC1_TEI1			GENBL1
#define	GEN_RIIC1_EEI1			GENBL1
#define	GEN_SCI10_TEI10			GENAL0
#define	GEN_SCI10_ERI10			GENAL0
#define	GEN_SCI11_TEI11			GENAL0
#define	GEN_SCI11_ERI11			GENAL0
#define	GEN_RSPI0_SPII0			GENAL0
#define	GEN_RSPI0_SPEI0			GENAL0
#define	GEN_RSPI1_SPII1			GENAL0
#define	GEN_RSPI1_SPEI1			GENAL0
#define	GEN_RSPI2_SPII2			GENAL0
#define	GEN_RSPI2_SPEI2			GENAL0
#define	GEN_RSPIA0_SPII			GENAL0
#define	GEN_RSPIA0_SPEI			GENAL0
#define	GEN_RSCI10_TEI			GENAL0
#define	GEN_RSCI10_ERI			GENAL0
#define	GEN_RSCI10_BFD			GENAL0
#define	GEN_RSCI11_TEI			GENAL0
#define	GEN_RSCI11_ERI			GENAL0
#define	GEN_RSCI11_BFD			GENAL0
#define	GEN_QSPIX_ERI			GENAL0
#define	GEN_RIICHS0_TEI			GENAL1
#define	GEN_RIICHS0_EEI			GENAL1

#define	GRP_DPFPU_DPFPUEX		GRPIE0
#define	GRP_CAN0_ERS0			GRPBE0
#define	GRP_CAN1_ERS1			GRPBE0
#define	GRP_SCI0_TEI0			GRPBL0
#define	GRP_SCI0_ERI0			GRPBL0
#define	GRP_SCI1_TEI1			GRPBL0
#define	GRP_SCI1_ERI1			GRPBL0
#define	GRP_SCI2_TEI2			GRPBL0
#define	GRP_SCI2_ERI2			GRPBL0
#define	GRP_SCI3_TEI3			GRPBL0
#define	GRP_SCI3_ERI3			GRPBL0
#define	GRP_SCI4_TEI4			GRPBL0
#define	GRP_SCI4_ERI4			GRPBL0
#define	GRP_SCI5_TEI5			GRPBL0
#define	GRP_SCI5_ERI5			GRPBL0
#define	GRP_SCI6_TEI6			GRPBL0
#define	GRP_SCI6_ERI6			GRPBL0
#define	GRP_SCI7_TEI7			GRPBL0
#define	GRP_SCI7_ERI7			GRPBL0
#define	GRP_SCI12_TEI12			GRPBL0
#define	GRP_SCI12_ERI12			GRPBL0
#define	GRP_SCI12_SCIX0			GRPBL0
#define	GRP_SCI12_SCIX1			GRPBL0
#define	GRP_SCI12_SCIX2			GRPBL0
#define	GRP_SCI12_SCIX3			GRPBL0
#define	GRP_CAC_FERRI			GRPBL0
#define	GRP_CAC_MENDI			GRPBL0
#define	GRP_CAC_OVFI			GRPBL0
#define	GRP_DOC_DOPCI			GRPBL0
#define	GRP_SDHI_CDETI			GRPBL1
#define	GRP_SDHI_CACI			GRPBL1
#define	GRP_SDHI_SDACI			GRPBL1
#define	GRP_POE3_OEI1			GRPBL1
#define	GRP_POE3_OEI2			GRPBL1
#define	GRP_POE3_OEI3			GRPBL1
#define	GRP_POE3_OEI4			GRPBL1
#define	GRP_RIIC0_TEI0			GRPBL1
#define	GRP_RIIC0_EEI0			GRPBL1
#define	GRP_RIIC2_TEI2			GRPBL1
#define	GRP_RIIC2_EEI2			GRPBL1
#define	GRP_SSIE0_SSIF0			GRPBL1
#define	GRP_S12AD_S12CMPAI		GRPBL1
#define	GRP_S12AD_S12CMPBI		GRPBL1
#define	GRP_S12AD1_S12CMPAI1	GRPBL1
#define	GRP_S12AD1_S12CMPBI1	GRPBL1
#define	GRP_SCI8_TEI8			GRPBL1
#define	GRP_SCI8_ERI8			GRPBL1
#define	GRP_SCI9_TEI9			GRPBL1
#define	GRP_SCI9_ERI9			GRPBL1
#define	GRP_RIIC1_TEI1			GRPBL1
#define	GRP_RIIC1_EEI1			GRPBL1
#define	GRP_SCI10_TEI10			GRPAL0
#define	GRP_SCI10_ERI10			GRPAL0
#define	GRP_SCI11_TEI11			GRPAL0
#define	GRP_SCI11_ERI11			GRPAL0
#define	GRP_RSPI0_SPII0			GRPAL0
#define	GRP_RSPI0_SPEI0			GRPAL0
#define	GRP_RSPI1_SPII1			GRPAL0
#define	GRP_RSPI1_SPEI1			GRPAL0
#define	GRP_RSPI2_SPII2			GRPAL0
#define	GRP_RSPI2_SPEI2			GRPAL0
#define	GRP_RSPIA0_SPII			GRPAL0
#define	GRP_RSPIA0_SPEI			GRPAL0
#define	GRP_RSCI10_TEI			GRPAL0
#define	GRP_RSCI10_ERI			GRPAL0
#define	GRP_RSCI10_BFD			GRPAL0
#define	GRP_RSCI11_TEI			GRPAL0
#define	GRP_RSCI11_ERI			GRPAL0
#define	GRP_RSCI11_BFD			GRPAL0
#define	GRP_QSPIX_ERI			GRPAL0
#define	GRP_RIICHS0_TEI			GRPAL1
#define	GRP_RIICHS0_EEI			GRPAL1

#define	GCR_DPFPU_DPFPUEX		GCRIE0
#define	GCR_CAN0_ERS0			GCRBE0
#define	GCR_CAN1_ERS1			GCRBE0

#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	__IS( x )		ICU.GRP ## x.BIT.IS ## x
#define	 _IS( x )		__IS( x )
#define	  IS( x , y )	_IS( _ ## x ## _ ## y )
#define	__EN( x )		ICU.GEN ## x.BIT.EN ## x
#define	 _EN( x )		__EN( x )
#define	  EN( x , y )	_EN( _ ## x ## _ ## y )
#define	__CLR( x )		ICU.GCR ## x.BIT.CLR ## x
#define	 _CLR( x )		__CLR( x )
#define	  CLR( x , y )	_CLR( _ ## x ## _ ## y )

#define	BSC			(*(volatile struct st_bsc         *)0x81300)
#define	CAC			(*(volatile struct st_cac         *)0x8B000)
#define	CAN0		(*(volatile struct st_can         *)0x90200)
#define	CAN1		(*(volatile struct st_can         *)0x91200)
#define	CMT			(*(volatile struct st_cmt         *)0x88000)
#define	CMT0		(*(volatile struct st_cmt0        *)0x88002)
#define	CMT1		(*(volatile struct st_cmt0        *)0x88008)
#define	CMT2		(*(volatile struct st_cmt0        *)0x88012)
#define	CMT3		(*(volatile struct st_cmt0        *)0x88018)
#define	CMTW0		(*(volatile struct st_cmtw        *)0x94200)
#define	CMTW1		(*(volatile struct st_cmtw        *)0x94280)
#define	CRC			(*(volatile struct st_crc         *)0x88280)
#define	CTSU		(*(volatile struct st_ctsu        *)0xA0900)
#define	DMAC		(*(volatile struct st_dmac        *)0x82200)
#define	DMAC0		(*(volatile struct st_dmac0       *)0x82000)
#define	DMAC1		(*(volatile struct st_dmac1       *)0x82040)
#define	DMAC2		(*(volatile struct st_dmac1       *)0x82080)
#define	DMAC3		(*(volatile struct st_dmac1       *)0x820C0)
#define	DMAC4		(*(volatile struct st_dmac1       *)0x82100)
#define	DMAC5		(*(volatile struct st_dmac1       *)0x82140)
#define	DMAC6		(*(volatile struct st_dmac1       *)0x82180)
#define	DMAC7		(*(volatile struct st_dmac1       *)0x821C0)
#define	DOC			(*(volatile struct st_doc         *)0xA0580)
#define	DTC			(*(volatile struct st_dtc         *)0x82400)
#define	ELC			(*(volatile struct st_elc         *)0x8B100)
#define	EXDMAC		(*(volatile struct st_exdmac      *)0x82A00)
#define	EXDMAC0		(*(volatile struct st_exdmac0     *)0x82800)
#define	EXDMAC1		(*(volatile struct st_exdmac1     *)0x82840)
#define	FLASH		(*(volatile struct st_flash       *)0x81000)
#define	FLASHCONST	(*(volatile struct st_flashconst  *)0xFE7F7D90)
#define	ICU			(*(volatile struct st_icu         *)0x87000)
#define	IWDT		(*(volatile struct st_iwdt        *)0x88030)
#define	MPC			(*(volatile struct st_mpc         *)0x8C100)
#define	MPU			(*(volatile struct st_mpu         *)0x86400)
#define	MTU			(*(volatile struct st_mtu         *)0xC120A)
#define	MTU0		(*(volatile struct st_mtu0        *)0xC1290)
#define	MTU1		(*(volatile struct st_mtu1        *)0xC1290)
#define	MTU2		(*(volatile struct st_mtu2        *)0xC1292)
#define	MTU3		(*(volatile struct st_mtu3        *)0xC1200)
#define	MTU4		(*(volatile struct st_mtu4        *)0xC1200)
#define	MTU5		(*(volatile struct st_mtu5        *)0xC1A94)
#define	MTU6		(*(volatile struct st_mtu6        *)0xC1A00)
#define	MTU7		(*(volatile struct st_mtu7        *)0xC1A00)
#define	MTU8		(*(volatile struct st_mtu8        *)0xC1298)
#define	OFSM		(*(volatile struct st_ofsm        *)0xFE7F5D00)
#define	POE3		(*(volatile struct st_poe         *)0x8C4C0)
#define	PORT0		(*(volatile struct st_port0       *)0x8C000)
#define	PORT1		(*(volatile struct st_port1       *)0x8C001)
#define	PORT2		(*(volatile struct st_port2       *)0x8C002)
#define	PORT3		(*(volatile struct st_port3       *)0x8C003)
#define	PORT4		(*(volatile struct st_port4       *)0x8C004)
#define	PORT5		(*(volatile struct st_port5       *)0x8C005)
#define	PORT6		(*(volatile struct st_port6       *)0x8C006)
#define	PORT7		(*(volatile struct st_port7       *)0x8C007)
#define	PORT8		(*(volatile struct st_port8       *)0x8C008)
#define	PORT9		(*(volatile struct st_port9       *)0x8C009)
#define	PORTA		(*(volatile struct st_porta       *)0x8C00A)
#define	PORTB		(*(volatile struct st_portb       *)0x8C00B)
#define	PORTC		(*(volatile struct st_portc       *)0x8C00C)
#define	PORTD		(*(volatile struct st_portd       *)0x8C00D)
#define	PORTE		(*(volatile struct st_porte       *)0x8C00E)
#define	PORTF		(*(volatile struct st_portf       *)0x8C00F)
#define	PORTH		(*(volatile struct st_porth       *)0x8C011)
#define	PORTJ		(*(volatile struct st_portj       *)0x8C012)
#define	PPG0		(*(volatile struct st_ppg0        *)0x881E6)
#define	PPG1		(*(volatile struct st_ppg1        *)0x881F0)
#define	QSPIX		(*(volatile struct st_qspix       *)0x74000000)
#define	RAM			(*(volatile struct st_ram         *)0x81200)
#define	REMC0		(*(volatile struct st_remc        *)0x8C29C)
#define	RIIC0		(*(volatile struct st_riic        *)0x88300)
#define	RIIC1		(*(volatile struct st_riic        *)0x88320)
#define	RIIC2		(*(volatile struct st_riic        *)0x88340)
#define	RIICHS0		(*(volatile struct st_riichs      *)0xEC014)
#define	RSCI10		(*(volatile struct st_rsci        *)0xE2000)
#define	RSCI11		(*(volatile struct st_rsci        *)0xE2080)
#define	RSPI0		(*(volatile struct st_rspi        *)0xD0100)
#define	RSPI1		(*(volatile struct st_rspi        *)0xD0140)
#define	RSPI2		(*(volatile struct st_rspi        *)0xD0300)
#define	RSPIA0		(*(volatile struct st_rspia       *)0xE2800)
#define	RTC			(*(volatile struct st_rtc         *)0x8C400)
#define	S12AD		(*(volatile struct st_s12ad       *)0x89000)
#define	S12AD1		(*(volatile struct st_s12ad1      *)0x89100)
#define	SCI0		(*(volatile struct st_sci0        *)0x8A000)
#define	SCI1		(*(volatile struct st_sci0        *)0x8A020)
#define	SCI2		(*(volatile struct st_sci0        *)0x8A040)
#define	SCI3		(*(volatile struct st_sci0        *)0x8A060)
#define	SCI4		(*(volatile struct st_sci0        *)0x8A080)
#define	SCI5		(*(volatile struct st_sci0        *)0x8A0A0)
#define	SCI6		(*(volatile struct st_sci0        *)0x8A0C0)
#define	SCI7		(*(volatile struct st_sci0        *)0x8A0E0)
#define	SCI8		(*(volatile struct st_sci0        *)0x8A100)
#define	SCI9		(*(volatile struct st_sci0        *)0x8A120)
#define	SCI10		(*(volatile struct st_sci10       *)0xD0040)
#define	SCI11		(*(volatile struct st_sci10       *)0xD0060)
#define	SCI12		(*(volatile struct st_sci12       *)0x8B300)
#define	SDHI		(*(volatile struct st_sdhi        *)0x8AC00)
#define	SMCI0		(*(volatile struct st_smci        *)0x8A000)
#define	SMCI1		(*(volatile struct st_smci        *)0x8A020)
#define	SMCI2		(*(volatile struct st_smci        *)0x8A040)
#define	SMCI3		(*(volatile struct st_smci        *)0x8A060)
#define	SMCI4		(*(volatile struct st_smci        *)0x8A080)
#define	SMCI5		(*(volatile struct st_smci        *)0x8A0A0)
#define	SMCI6		(*(volatile struct st_smci        *)0x8A0C0)
#define	SMCI7		(*(volatile struct st_smci        *)0x8A0E0)
#define	SMCI8		(*(volatile struct st_smci        *)0x8A100)
#define	SMCI9		(*(volatile struct st_smci        *)0x8A120)
#define	SMCI10		(*(volatile struct st_smci        *)0xD0040)
#define	SMCI11		(*(volatile struct st_smci        *)0xD0060)
#define	SMCI12		(*(volatile struct st_smci        *)0x8B300)
#define	SSIE0		(*(volatile struct st_ssie        *)0x8A500)
#define	SYSTEM		(*(volatile struct st_system      *)0x80000)
#define	TEMPS		(*(volatile struct st_temps       *)0x8C500)
#define	TEMPSCONST	(*(volatile struct st_tempsconst  *)0xFE7F7D7C)
#define	TMR0		(*(volatile struct st_tmr0        *)0x88200)
#define	TMR1		(*(volatile struct st_tmr1        *)0x88201)
#define	TMR2		(*(volatile struct st_tmr0        *)0x88210)
#define	TMR3		(*(volatile struct st_tmr1        *)0x88211)
#define	TMR01		(*(volatile struct st_tmr01       *)0x88204)
#define	TMR23		(*(volatile struct st_tmr01       *)0x88214)
#define	TPU0		(*(volatile struct st_tpu0        *)0x88108)
#define	TPU1		(*(volatile struct st_tpu1        *)0x88108)
#define	TPU2		(*(volatile struct st_tpu2        *)0x8810A)
#define	TPU3		(*(volatile struct st_tpu3        *)0x8810A)
#define	TPU4		(*(volatile struct st_tpu4        *)0x8810C)
#define	TPU5		(*(volatile struct st_tpu5        *)0x8810C)
#define	TPUA		(*(volatile struct st_tpua        *)0x88100)
#define	USB			(*(volatile struct st_usb         *)0xA0400)
#define	USB0		(*(volatile struct st_usb0        *)0xA0000)
#define	USB1		(*(volatile struct st_usb1        *)0xA0200)
#define	WDT			(*(volatile struct st_wdt         *)0x88020)

typedef enum enum_ir {
IR_BSC_BUSERR=16,IR_ICU_GROUPIE0=17,
IR_RAM_RAMERR,
IR_FCU_FIFERR=21,IR_FCU_FRDYI=23,
IR_ICU_SWINT2=26,IR_ICU_SWINT,
IR_CMT0_CMI0,
IR_CMT1_CMI1,
IR_CMTW0_CMWI0,
IR_CMTW1_CMWI1,
IR_RSCI10_RXI,IR_RSCI10_TXI,
IR_USB0_D0FIFO0,IR_USB0_D1FIFO0,
IR_USB1_D0FIFO1,IR_USB1_D1FIFO1,
IR_RSPI0_SPRI0,IR_RSPI0_SPTI0,
IR_RSPI1_SPRI1,IR_RSPI1_SPTI1,
IR_RSCI11_RXI,IR_RSCI11_TXI,
IR_SDHI_SBFAI,
IR_SSIE0_SSITXI0=46,IR_SSIE0_SSIRXI0,
IR_RSPIA0_SPRI,IR_RSPIA0_SPTI,
IR_RIIC1_RXI1,IR_RIIC1_TXI1,
IR_RIIC0_RXI0,IR_RIIC0_TXI0,
IR_RIIC2_RXI2,IR_RIIC2_TXI2,
IR_SCI0_RXI0=58,IR_SCI0_TXI0,
IR_SCI1_RXI1,IR_SCI1_TXI1,
IR_SCI2_RXI2,IR_SCI2_TXI2,
IR_ICU_IRQ0,IR_ICU_IRQ1,IR_ICU_IRQ2,IR_ICU_IRQ3,IR_ICU_IRQ4,IR_ICU_IRQ5,IR_ICU_IRQ6,IR_ICU_IRQ7,
IR_ICU_IRQ8,IR_ICU_IRQ9,IR_ICU_IRQ10,IR_ICU_IRQ11,IR_ICU_IRQ12,IR_ICU_IRQ13,IR_ICU_IRQ14,IR_ICU_IRQ15,
IR_SCI3_RXI3,IR_SCI3_TXI3,
IR_SCI4_RXI4,IR_SCI4_TXI4,
IR_SCI5_RXI5,IR_SCI5_TXI5,
IR_SCI6_RXI6,IR_SCI6_TXI6,
IR_LVD1_LVD1,
IR_LVD2_LVD2,
IR_USB0_USBR0,
IR_VBATT_TAMPDI,
IR_RTC_ALM,IR_RTC_PRD,
IR_REMC0_REMCI0,
IR_IWDT_IWUNI,
IR_WDT_WUNI,
IR_SCI7_RXI7=98,IR_SCI7_TXI7,
IR_SCI8_RXI8,IR_SCI8_TXI8,
IR_SCI9_RXI9,IR_SCI9_TXI9,
IR_SCI10_RXI10,IR_SCI10_TXI10,
IR_ICU_GROUPBE0,
IR_RSPI2_SPRI2=108,IR_RSPI2_SPTI2,
IR_ICU_GROUPBL0,IR_ICU_GROUPBL1,IR_ICU_GROUPAL0,IR_ICU_GROUPAL1,
IR_SCI11_RXI11,IR_SCI11_TXI11,
IR_SCI12_RXI12,IR_SCI12_TXI12,
IR_RIICHS0_RXI,IR_RIICHS0_TXI,
IR_DMAC_DMAC0I,IR_DMAC_DMAC1I,IR_DMAC_DMAC2I,IR_DMAC_DMAC3I,IR_DMAC_DMAC74I,
IR_OST_OSTDI,
IR_EXDMAC_EXDMAC0I,IR_EXDMAC_EXDMAC1I,
IR_PERIB_INTB128,IR_PERIB_INTB129,IR_PERIB_INTB130,IR_PERIB_INTB131,IR_PERIB_INTB132,
IR_PERIB_INTB133,IR_PERIB_INTB134,IR_PERIB_INTB135,IR_PERIB_INTB136,IR_PERIB_INTB137,
IR_PERIB_INTB138,IR_PERIB_INTB139,IR_PERIB_INTB140,IR_PERIB_INTB141,IR_PERIB_INTB142,
IR_PERIB_INTB143,IR_PERIB_INTB144,IR_PERIB_INTB145,IR_PERIB_INTB146,IR_PERIB_INTB147,
IR_PERIB_INTB148,IR_PERIB_INTB149,IR_PERIB_INTB150,IR_PERIB_INTB151,IR_PERIB_INTB152,
IR_PERIB_INTB153,IR_PERIB_INTB154,IR_PERIB_INTB155,IR_PERIB_INTB156,IR_PERIB_INTB157,
IR_PERIB_INTB158,IR_PERIB_INTB159,IR_PERIB_INTB160,IR_PERIB_INTB161,IR_PERIB_INTB162,
IR_PERIB_INTB163,IR_PERIB_INTB164,IR_PERIB_INTB165,IR_PERIB_INTB166,IR_PERIB_INTB167,
IR_PERIB_INTB168,IR_PERIB_INTB169,IR_PERIB_INTB170,IR_PERIB_INTB171,IR_PERIB_INTB172,
IR_PERIB_INTB173,IR_PERIB_INTB174,IR_PERIB_INTB175,IR_PERIB_INTB176,IR_PERIB_INTB177,
IR_PERIB_INTB178,IR_PERIB_INTB179,IR_PERIB_INTB180,IR_PERIB_INTB181,IR_PERIB_INTB182,
IR_PERIB_INTB183,IR_PERIB_INTB184,IR_PERIB_INTB185,IR_PERIB_INTB186,IR_PERIB_INTB187,
IR_PERIB_INTB188,IR_PERIB_INTB189,IR_PERIB_INTB190,IR_PERIB_INTB191,IR_PERIB_INTB192,
IR_PERIB_INTB193,IR_PERIB_INTB194,IR_PERIB_INTB195,IR_PERIB_INTB196,IR_PERIB_INTB197,
IR_PERIB_INTB198,IR_PERIB_INTB199,IR_PERIB_INTB200,IR_PERIB_INTB201,IR_PERIB_INTB202,
IR_PERIB_INTB203,IR_PERIB_INTB204,IR_PERIB_INTB205,IR_PERIB_INTB206,IR_PERIB_INTB207,
IR_PERIA_INTA208,IR_PERIA_INTA209,IR_PERIA_INTA210,IR_PERIA_INTA211,IR_PERIA_INTA212,
IR_PERIA_INTA213,IR_PERIA_INTA214,IR_PERIA_INTA215,IR_PERIA_INTA216,IR_PERIA_INTA217,
IR_PERIA_INTA218,IR_PERIA_INTA219,IR_PERIA_INTA220,IR_PERIA_INTA221,IR_PERIA_INTA222,
IR_PERIA_INTA223,IR_PERIA_INTA224,IR_PERIA_INTA225,IR_PERIA_INTA226,IR_PERIA_INTA227,
IR_PERIA_INTA228,IR_PERIA_INTA229,IR_PERIA_INTA230,IR_PERIA_INTA231,IR_PERIA_INTA232,
IR_PERIA_INTA233,IR_PERIA_INTA234,IR_PERIA_INTA235,IR_PERIA_INTA236,IR_PERIA_INTA237,
IR_PERIA_INTA238,IR_PERIA_INTA239,IR_PERIA_INTA240,IR_PERIA_INTA241,IR_PERIA_INTA242,
IR_PERIA_INTA243,IR_PERIA_INTA244,IR_PERIA_INTA245,IR_PERIA_INTA246,IR_PERIA_INTA247,
IR_PERIA_INTA248,IR_PERIA_INTA249,IR_PERIA_INTA250,IR_PERIA_INTA251,IR_PERIA_INTA252,
IR_PERIA_INTA253,IR_PERIA_INTA254,IR_PERIA_INTA255
} enum_ir_t;

