renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx671/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} EDMSTS;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DREQS : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DREQS : 2;
#endif
	} BIT;
	} EDMRMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char EREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char EREQ : 1;
#endif
	} BIT;
	} EDMERF;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PREQ : 1;
#endif
	} BIT;
	} EDMPRF;
} st_exdmac0_t;

typedef struct st_exdmac1 {
	void          *EDMSAR;
	void          *EDMDAR;
	unsigned long  EDMCRA;
	unsigned short EDMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCTG : 2;
			unsigned short  : 6;
			unsigned short SZ : 2;
			unsigned short  : 2;
			unsigned short DTS : 2;
			unsigned short MD : 2;
#else
			unsigned short MD : 2;
			unsigned short DTS : 2;
			unsigned short  : 2;
			unsigned short SZ : 2;
			unsigned short  : 6;
			unsigned short DCTG : 2;
#endif
	} BIT;
	} EDMTMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DACKSEL : 1;
			unsigned char DACKW : 1;
			unsigned char DACKE : 1;
			unsigned char DACKS : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char DACKS : 1;
			unsigned char DACKE : 1;
			unsigned char DACKW : 1;
			unsigned char DACKSEL : 1;
#endif
	} BIT;
	} EDMOMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DARIE : 1;
			unsigned char SARIE : 1;
			unsigned char RPTIE : 1;
			unsigned char ESIE : 1;
			unsigned char DTIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char DTIE : 1;
			unsigned char ESIE : 1;
			unsigned char RPTIE : 1;
			unsigned char SARIE : 1;
			unsigned char DARIE : 1;
#endif
	} BIT;
	} EDMINT;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DARA : 5;
			unsigned long  : 1;
			unsigned long DM : 2;
			unsigned long SARA : 5;
			unsigned long  : 1;
			unsigned long SM : 2;
			unsigned long DIR : 1;
			unsigned long AMS : 1;
			unsigned long  : 14;
#else
			unsigned long  : 14;
			unsigned long AMS : 1;
			unsigned long DIR : 1;
			unsigned long SM : 2;
			unsigned long  : 1;
			unsigned long SARA : 5;
			unsigned long DM : 2;
			unsigned long  : 1;
			unsigned long DARA : 5;
#endif
	} BIT;
	} EDMAMD;
	char           wk1[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTE : 1;
#endif
	} BIT;
	} EDMCNT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWREQ : 1;
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
			unsigned char SWREQ : 1;
#endif
	} BIT;
	} EDMREQ;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} EDMSTS;
	char           wk2[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DREQS : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DREQS : 2;
#endif
	} BIT;
	} EDMRMD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char EREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char EREQ : 1;
#endif
	} BIT;
	} EDMERF;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PREQ : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PREQ : 1;
#endif
	} BIT;
	} EDMPRF;
} st_exdmac1_t;

typedef struct st_flash {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ROMCEN : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ROMCEN : 1;
#endif
	} BIT;
	} ROMCE;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ROMCIV : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ROMCIV : 1;
#endif
	} BIT;
	} ROMCIV;
	char           wk1[58];
	unsigned long  NCRG0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long NC1E : 1;
			unsigned long NC2E : 1;
			unsigned long NC3E : 1;
			unsigned long NCSZ : 17;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long NCSZ : 17;
			unsigned long NC3E : 1;
			unsigned long NC2E : 1;
			unsigned long NC1E : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} NCRC0;
	unsigned long  NCRG1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long NC1E : 1;
			unsigned long NC2E : 1;
			unsigned long NC3E : 1;
			unsigned long NCSZ : 17;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long NCSZ : 17;
			unsigned long NC3E : 1;
			unsigned long NC2E : 1;
			unsigned long NC1E : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} NCRC1;
	char           wk2[45638];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FLWE : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char FLWE : 2;
#endif
	} BIT;
	} FWEPROR;
	char           wk3[7798185];
	unsigned char  EEPFCLK;
	char           wk4[8143];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char DFAE : 1;
			unsigned char CMDLK : 1;
			unsigned char  : 2;
			unsigned char CFAE : 1;
#else
			unsigned char CFAE : 1;
			unsigned char  : 2;
			unsigned char CMDLK : 1;
			unsigned char DFAE : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} FASTAT;
	char           wk5[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char DFAEIE : 1;
			unsigned char CMDLKIE : 1;
			unsigned char  : 2;
			unsigned char CFAEIE : 1;
#else
			unsigned char CFAEIE : 1;
			unsigned char  : 2;
			unsigned char CMDLKIE : 1;
			unsigned char DFAEIE : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} FAEINT;
	char           wk6[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FRDYIE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char FRDYIE : 1;
#endif
	} BIT;
	} FRDYIE;
	char           wk7[23];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FSADDR : 32;
#else
			unsigned long FSADDR : 32;
#endif
	} BIT;
	} FSADDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FEADDR : 32;
#else
			unsigned long FEADDR : 32;
#endif
	} BIT;
	} FEADDR;
	char           wk8[72];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 6;
			unsigned long FLWEERR : 1;
			unsigned long  : 1;
			unsigned long PRGSPD : 1;
			unsigned long ERSSPD : 1;
			unsigned long DBFULL : 1;
			unsigned long SUSRDY : 1;
			unsigned long PRGERR : 1;
			unsigned long ERSERR : 1;
			unsigned long ILGLERR : 1;
			unsigned long FRDY : 1;
			unsigned long  : 4;
			unsigned long OTERR : 1;
			unsigned long SECERR : 1;
			unsigned long FESETERR : 1;
			unsigned long ILGCOMERR : 1;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long ILGCOMERR : 1;
			unsigned long FESETERR : 1;
			unsigned long SECERR : 1;
			unsigned long OTERR : 1;
			unsigned long  : 4;
			unsigned long FRDY : 1;
			unsigned long ILGLERR : 1;
			unsigned long ERSERR : 1;
			unsigned long PRGERR : 1;
			unsigned long SUSRDY : 1;
			unsigned long DBFULL : 1;
			unsigned long ERSSPD : 1;
			unsigned long PRGSPD : 1;
			unsigned long  : 1;
			unsigned long FLWEERR : 1;
			unsigned long  : 6;
#endif
	} BIT;
	} FSTATR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FENTRYC : 1;
			unsigned short  : 6;
			unsigned short FENTRYD : 1;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short FENTRYD : 1;
			unsigned short  : 6;
			unsigned short FENTRYC : 1;
#endif
	} BIT;
	} FENTRYR;
	char           wk9[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SUINIT : 1;
			unsigned short  : 7;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short  : 7;
			unsigned short SUINIT : 1;
#endif
	} BIT;
	} FSUINITR;
	char           wk10[18];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PCMDR : 8;
			unsigned short CMDR : 8;
#else
			unsigned short CMDR : 8;
			unsigned short PCMDR : 8;
#endif
	} BIT;
	} FCMDR;
	char           wk11[46];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCDIR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char BCDIR : 1;
#endif
	} BIT;
	} FBCCNT;
	char           wk12[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char BCST : 1;
#endif
	} BIT;
	} FBCSTAT;
	char           wk13[3];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PSADR : 17;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long PSADR : 17;
#endif
	} BIT;
	} FPSADDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FAWS : 12;
			unsigned long  : 3;
			unsigned long FSPR : 1;
			unsigned long FAWE : 12;
			unsigned long  : 3;
			unsigned long BTFLG : 1;
#else
			unsigned long BTFLG : 1;
			unsigned long  : 3;
			unsigned long FAWE : 12;
			unsigned long FSPR : 1;
			unsigned long  : 3;
			unsigned long FAWS : 12;
#endif
	} BIT;
	} FAWMON;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ESUSPMD : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ESUSPMD : 1;
#endif
	} BIT;
	} FCPSR;
	char           wk14[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PCKA : 8;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short PCKA : 8;
#endif
	} BIT;
	} FPCKAR;
	char           wk15[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SAS : 2;
			unsigned short  : 6;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short  : 6;
			unsigned short SAS : 2;
#endif
	} BIT;
	} FSUACR;
} st_flash_t;

typedef struct st_flashconst {
	unsigned long  UIDR0;
	unsigned long  UIDR1;
	unsigned long  UIDR2;
	unsigned long  UIDR3;
} st_flashconst_t;

typedef struct st_icu {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char IR : 1;
#endif
	} BIT;
	} IR[256];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTCE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTCE : 1;
#endif
	} BIT;
	} DTCER[256];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IEN0 : 1;
			unsigned char IEN1 : 1;
			unsigned char IEN2 : 1;
			unsigned char IEN3 : 1;
			unsigned char IEN4 : 1;
			unsigned char IEN5 : 1;
			unsigned char IEN6 : 1;
			unsigned char IEN7 : 1;
#else
			unsigned char IEN7 : 1;
			unsigned char IEN6 : 1;
			unsigned char IEN5 : 1;
			unsigned char IEN4 : 1;
			unsigned char IEN3 : 1;
			unsigned char IEN2 : 1;
			unsigned char IEN1 : 1;
			unsigned char IEN0 : 1;
#endif
	} BIT;
	} IER[32];
	char           wk0[192];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWINT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SWINT : 1;
#endif
	} BIT;
	} SWINTR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWINT2 : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SWINT2 : 1;
#endif
	} BIT;
	} SWINT2R;
	char           wk1[14];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FVCT : 8;
			unsigned short  : 7;
			unsigned short FIEN : 1;
#else
			unsigned short FIEN : 1;
			unsigned short  : 7;
			unsigned short FVCT : 8;
#endif
	} BIT;
	} FIR;
	char           wk2[14];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IPR : 4;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char IPR : 4;
#endif
	} BIT;
	} IPR[256];
	unsigned char  DMRSR0;
	char           wk3[3];
	unsigned char  DMRSR1;
	char           wk4[3];
	unsigned char  DMRSR2;
	char           wk5[3];
	unsigned char  DMRSR3;
	char           wk6[3];
	unsigned char  DMRSR4;
	char           wk7[3];
	unsigned char  DMRSR5;
	char           wk8[3];
	unsigned char  DMRSR6;
	char           wk9[3];
	unsigned char  DMRSR7;
	char           wk10[227];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 2;
			unsigned char IRQMD : 2;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char IRQMD : 2;
			unsigned char  : 2;
#endif
	} BIT;
	} IRQCR[16];
	char           wk11[16];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FLTEN0 : 1;
			unsigned char FLTEN1 : 1;
			unsigned char FLTEN2 : 1;
			unsigned char FLTEN3 : 1;
			unsigned char FLTEN4 : 1;
			unsigned char FLTEN5 : 1;
			unsigned char FLTEN6 : 1;
			unsigned char FLTEN7 : 1;
#else
			unsigned char FLTEN7 : 1;
			unsigned char FLTEN6 : 1;
			unsigned char FLTEN5 : 1;
			unsigned char FLTEN4 : 1;
			unsigned char FLTEN3 : 1;
			unsigned char FLTEN2 : 1;
			unsigned char FLTEN1 : 1;
			unsigned char FLTEN0 : 1;
#endif
	} BIT;
	} IRQFLTE0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FLTEN8 : 1;
			unsigned char FLTEN9 : 1;
			unsigned char FLTEN10 : 1;
			unsigned char FLTEN11 : 1;
			unsigned char FLTEN12 : 1;
			unsigned char FLTEN13 : 1;
			unsigned char FLTEN14 : 1;
			unsigned char FLTEN15 : 1;
#else
			unsigned char FLTEN15 : 1;
			unsigned char FLTEN14 : 1;
			unsigned char FLTEN13 : 1;
			unsigned char FLTEN12 : 1;
			unsigned char FLTEN11 : 1;
			unsigned char FLTEN10 : 1;
			unsigned char FLTEN9 : 1;
			unsigned char FLTEN8 : 1;
#endif
	} BIT;
	} IRQFLTE1;
	char           wk12[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FCLKSEL0 : 2;
			unsigned short FCLKSEL1 : 2;
			unsigned short FCLKSEL2 : 2;
			unsigned short FCLKSEL3 : 2;
			unsigned short FCLKSEL4 : 2;
			unsigned short FCLKSEL5 : 2;
			unsigned short FCLKSEL6 : 2;
			unsigned short FCLKSEL7 : 2;
#else
			unsigned short FCLKSEL7 : 2;
			unsigned short FCLKSEL6 : 2;
			unsigned short FCLKSEL5 : 2;
			unsigned short FCLKSEL4 : 2;
			unsigned short FCLKSEL3 : 2;
			unsigned short FCLKSEL2 : 2;
			unsigned short FCLKSEL1 : 2;
			unsigned short FCLKSEL0 : 2;
#endif
	} BIT;
	} IRQFLTC0;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FCLKSEL8 : 2;
			unsigned short FCLKSEL9 : 2;
			unsigned short FCLKSEL10 : 2;
			unsigned short FCLKSEL11 : 2;
			unsigned short FCLKSEL12 : 2;
			unsigned short FCLKSEL13 : 2;
			unsigned short FCLKSEL14 : 2;
			unsigned short FCLKSEL15 : 2;
#else
			unsigned short FCLKSEL15 : 2;
			unsigned short FCLKSEL14 : 2;
			unsigned short FCLKSEL13 : 2;
			unsigned short FCLKSEL12 : 2;
			unsigned short FCLKSEL11 : 2;
			unsigned short FCLKSEL10 : 2;
			unsigned short FCLKSEL9 : 2;
			unsigned short FCLKSEL8 : 2;
#endif
	} BIT;
	} IRQFLTC1;
	char           wk13[84];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NMIST : 1;
			unsigned char OSTST : 1;
			unsigned char WDTST : 1;
			unsigned char IWDTST : 1;
			unsigned char LVD1ST : 1;
			unsigned char LVD2ST : 1;
			unsigned char EXNMIST : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char EXNMIST : 1;
			unsigned char LVD2ST : 1;
			unsigned char LVD1ST : 1;
			unsigned char IWDTST : 1;
			unsigned char WDTST : 1;
			unsigned char OSTST : 1;
			unsigned char NMIST : 1;
#endif
	} BIT;
	} NMISR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NMIEN : 1;
			unsigned char OSTEN : 1;
			unsigned char WDTEN : 1;
			unsigned char IWDTEN : 1;
			unsigned char LVD1EN : 1;
			unsigned char LVD2EN : 1;
			unsigned char EXNMIEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char EXNMIEN : 1;
			unsigned char LVD2EN : 1;
			unsigned char LVD1EN : 1;
			unsigned char IWDTEN : 1;
			unsigned char WDTEN : 1;
			unsigned char OSTEN : 1;
			unsigned char NMIEN : 1;
#endif
	} BIT;
	} NMIER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NMICLR : 1;
			unsigned char OSTCLR : 1;
			unsigned char WDTCLR : 1;
			unsigned char IWDTCLR : 1;
			unsigned char LVD1CLR : 1;
			unsigned char LVD2CLR : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char LVD2CLR : 1;
			unsigned char LVD1CLR : 1;
			unsigned char IWDTCLR : 1;
			unsigned char WDTCLR : 1;
			unsigned char OSTCLR : 1;
			unsigned char NMICLR : 1;
#endif
	} BIT;
	} NMICLR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char NMIMD : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char NMIMD : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} NMICR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RAMST : 1;
			unsigned char DPFPUST : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DPFPUST : 1;
			unsigned char RAMST : 1;
#endif
	} BIT;
	} EXNMISR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RAMEN : 1;
			unsigned char DPFPUEN : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DPFPUEN : 1;
			unsigned char RAMEN : 1;
#endif
	} BIT;
	} EXNMIER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 1;
			unsigned char DPFPUCLR : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DPFPUCLR : 1;
			unsigned char  : 1;
#endif
	} BIT;
	} EXNMICLR;
	char           wk14[9];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NFLTEN : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char NFLTEN : 1;
#endif
	} BIT;
	} NMIFLTE;
	char           wk15[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NFCLKSEL : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char NFCLKSEL : 2;
#endif
	} BIT;
	} NMIFLTC;
	char           wk16[27];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IS0 : 1;
			unsigned long IS1 : 1;
			unsigned long IS2 : 1;
			unsigned long IS3 : 1;
			unsigned long IS4 : 1;
			unsigned long IS5 : 1;
			unsigned long IS6 : 1;
			unsigned long IS7 : 1;
			unsigned long IS8 : 1;
			unsigned long IS9 : 1;
			unsigned long IS10 : 1;
			unsigned long IS11 : 1;
			unsigned long IS12 : 1;
			unsigned long IS13 : 1;
			unsigned long IS14 : 1;
			unsigned long IS15 : 1;
			unsigned long IS16 : 1;
			unsigned long IS17 : 1;
			unsigned long IS18 : 1;
			unsigned long IS19 : 1;
			unsigned long IS20 : 1;
			unsigned long IS21 : 1;
			unsigned long IS22 : 1;
			unsigned long IS23 : 1;
			unsigned long IS24 : 1;
			unsigned long IS25 : 1;
			unsigned long IS26 : 1;
			unsigned long IS27 : 1;
			unsigned long IS28 : 1;
			unsigned long IS29 : 1;
			unsigned long IS30 : 1;
			unsigned long IS31 : 1;
#else
			unsigned long IS31 : 1;
			unsigned long IS30 : 1;
			unsigned long IS29 : 1;
			unsigned long IS28 : 1;
			unsigned long IS27 : 1;
			unsigned long IS26 : 1;
			unsigned long IS25 : 1;
			unsigned long IS24 : 1;
			unsigned long IS23 : 1;
			unsigned long IS22 : 1;
			unsigned long IS21 : 1;
			unsigned long IS20 : 1;
			unsigned long IS19 : 1;
			unsigned long IS18 : 1;
			unsigned long IS17 : 1;
			unsigned long IS16 : 1;
			unsigned long IS15 : 1;
			unsigned long IS14 : 1;
			unsigned long IS13 : 1;
			unsigned long IS12 : 1;
			unsigned long IS11 : 1;
			unsigned long IS10 : 1;
			unsigned long IS9 : 1;
			unsigned long IS8 : 1;
			unsigned long IS7 : 1;
			unsigned long IS6 : 1;
			unsigned long IS5 : 1;
			unsigned long IS4 : 1;
			unsigned long IS3 : 1;
			unsigned long IS2 : 1;
			unsigned long IS1 : 1;
			unsigned long IS0 : 1;
#endif
	} BIT;
	} GRPIE0;
	union {
		unsigned long LONG;
		struct {
			
