renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx671/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENIE0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CLR0 : 1;
			unsigned long CLR1 : 1;
			unsigned long CLR2 : 1;
			unsigned long CLR3 : 1;
			unsigned long CLR4 : 1;
			unsigned long CLR5 : 1;
			unsigned long CLR6 : 1;
			unsigned long CLR7 : 1;
			unsigned long CLR8 : 1;
			unsigned long CLR9 : 1;
			unsigned long CLR10 : 1;
			unsigned long CLR11 : 1;
			unsigned long CLR12 : 1;
			unsigned long CLR13 : 1;
			unsigned long CLR14 : 1;
			unsigned long CLR15 : 1;
			unsigned long CLR16 : 1;
			unsigned long CLR17 : 1;
			unsigned long CLR18 : 1;
			unsigned long CLR19 : 1;
			unsigned long CLR20 : 1;
			unsigned long CLR21 : 1;
			unsigned long CLR22 : 1;
			unsigned long CLR23 : 1;
			unsigned long CLR24 : 1;
			unsigned long CLR25 : 1;
			unsigned long CLR26 : 1;
			unsigned long CLR27 : 1;
			unsigned long CLR28 : 1;
			unsigned long CLR29 : 1;
			unsigned long CLR30 : 1;
			unsigned long CLR31 : 1;
#else
			unsigned long CLR31 : 1;
			unsigned long CLR30 : 1;
			unsigned long CLR29 : 1;
			unsigned long CLR28 : 1;
			unsigned long CLR27 : 1;
			unsigned long CLR26 : 1;
			unsigned long CLR25 : 1;
			unsigned long CLR24 : 1;
			unsigned long CLR23 : 1;
			unsigned long CLR22 : 1;
			unsigned long CLR21 : 1;
			unsigned long CLR20 : 1;
			unsigned long CLR19 : 1;
			unsigned long CLR18 : 1;
			unsigned long CLR17 : 1;
			unsigned long CLR16 : 1;
			unsigned long CLR15 : 1;
			unsigned long CLR14 : 1;
			unsigned long CLR13 : 1;
			unsigned long CLR12 : 1;
			unsigned long CLR11 : 1;
			unsigned long CLR10 : 1;
			unsigned long CLR9 : 1;
			unsigned long CLR8 : 1;
			unsigned long CLR7 : 1;
			unsigned long CLR6 : 1;
			unsigned long CLR5 : 1;
			unsigned long CLR4 : 1;
			unsigned long CLR3 : 1;
			unsigned long CLR2 : 1;
			unsigned long CLR1 : 1;
			unsigned long CLR0 : 1;
#endif
	} BIT;
	} GCRIE0;
	char           wk17[68];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IS0 : 1;
			unsigned long IS1 : 1;
			unsigned long IS2 : 1;
			unsigned long IS3 : 1;
			unsigned long IS4 : 1;
			unsigned long IS5 : 1;
			unsigned long IS6 : 1;
			unsigned long IS7 : 1;
			unsigned long IS8 : 1;
			unsigned long IS9 : 1;
			unsigned long IS10 : 1;
			unsigned long IS11 : 1;
			unsigned long IS12 : 1;
			unsigned long IS13 : 1;
			unsigned long IS14 : 1;
			unsigned long IS15 : 1;
			unsigned long IS16 : 1;
			unsigned long IS17 : 1;
			unsigned long IS18 : 1;
			unsigned long IS19 : 1;
			unsigned long IS20 : 1;
			unsigned long IS21 : 1;
			unsigned long IS22 : 1;
			unsigned long IS23 : 1;
			unsigned long IS24 : 1;
			unsigned long IS25 : 1;
			unsigned long IS26 : 1;
			unsigned long IS27 : 1;
			unsigned long IS28 : 1;
			unsigned long IS29 : 1;
			unsigned long IS30 : 1;
			unsigned long IS31 : 1;
#else
			unsigned long IS31 : 1;
			unsigned long IS30 : 1;
			unsigned long IS29 : 1;
			unsigned long IS28 : 1;
			unsigned long IS27 : 1;
			unsigned long IS26 : 1;
			unsigned long IS25 : 1;
			unsigned long IS24 : 1;
			unsigned long IS23 : 1;
			unsigned long IS22 : 1;
			unsigned long IS21 : 1;
			unsigned long IS20 : 1;
			unsigned long IS19 : 1;
			unsigned long IS18 : 1;
			unsigned long IS17 : 1;
			unsigned long IS16 : 1;
			unsigned long IS15 : 1;
			unsigned long IS14 : 1;
			unsigned long IS13 : 1;
			unsigned long IS12 : 1;
			unsigned long IS11 : 1;
			unsigned long IS10 : 1;
			unsigned long IS9 : 1;
			unsigned long IS8 : 1;
			unsigned long IS7 : 1;
			unsigned long IS6 : 1;
			unsigned long IS5 : 1;
			unsigned long IS4 : 1;
			unsigned long IS3 : 1;
			unsigned long IS2 : 1;
			unsigned long IS1 : 1;
			unsigned long IS0 : 1;
#endif
	} BIT;
	} GRPBE0;
	char           wk18[44];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IS0 : 1;
			unsigned long IS1 : 1;
			unsigned long IS2 : 1;
			unsigned long IS3 : 1;
			unsigned long IS4 : 1;
			unsigned long IS5 : 1;
			unsigned long IS6 : 1;
			unsigned long IS7 : 1;
			unsigned long IS8 : 1;
			unsigned long IS9 : 1;
			unsigned long IS10 : 1;
			unsigned long IS11 : 1;
			unsigned long IS12 : 1;
			unsigned long IS13 : 1;
			unsigned long IS14 : 1;
			unsigned long IS15 : 1;
			unsigned long IS16 : 1;
			unsigned long IS17 : 1;
			unsigned long IS18 : 1;
			unsigned long IS19 : 1;
			unsigned long IS20 : 1;
			unsigned long IS21 : 1;
			unsigned long IS22 : 1;
			unsigned long IS23 : 1;
			unsigned long IS24 : 1;
			unsigned long IS25 : 1;
			unsigned long IS26 : 1;
			unsigned long IS27 : 1;
			unsigned long IS28 : 1;
			unsigned long IS29 : 1;
			unsigned long IS30 : 1;
			unsigned long IS31 : 1;
#else
			unsigned long IS31 : 1;
			unsigned long IS30 : 1;
			unsigned long IS29 : 1;
			unsigned long IS28 : 1;
			unsigned long IS27 : 1;
			unsigned long IS26 : 1;
			unsigned long IS25 : 1;
			unsigned long IS24 : 1;
			unsigned long IS23 : 1;
			unsigned long IS22 : 1;
			unsigned long IS21 : 1;
			unsigned long IS20 : 1;
			unsigned long IS19 : 1;
			unsigned long IS18 : 1;
			unsigned long IS17 : 1;
			unsigned long IS16 : 1;
			unsigned long IS15 : 1;
			unsigned long IS14 : 1;
			unsigned long IS13 : 1;
			unsigned long IS12 : 1;
			unsigned long IS11 : 1;
			unsigned long IS10 : 1;
			unsigned long IS9 : 1;
			unsigned long IS8 : 1;
			unsigned long IS7 : 1;
			unsigned long IS6 : 1;
			unsigned long IS5 : 1;
			unsigned long IS4 : 1;
			unsigned long IS3 : 1;
			unsigned long IS2 : 1;
			unsigned long IS1 : 1;
			unsigned long IS0 : 1;
#endif
	} BIT;
	} GRPBL0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IS0 : 1;
			unsigned long IS1 : 1;
			unsigned long IS2 : 1;
			unsigned long IS3 : 1;
			unsigned long IS4 : 1;
			unsigned long IS5 : 1;
			unsigned long IS6 : 1;
			unsigned long IS7 : 1;
			unsigned long IS8 : 1;
			unsigned long IS9 : 1;
			unsigned long IS10 : 1;
			unsigned long IS11 : 1;
			unsigned long IS12 : 1;
			unsigned long IS13 : 1;
			unsigned long IS14 : 1;
			unsigned long IS15 : 1;
			unsigned long IS16 : 1;
			unsigned long IS17 : 1;
			unsigned long IS18 : 1;
			unsigned long IS19 : 1;
			unsigned long IS20 : 1;
			unsigned long IS21 : 1;
			unsigned long IS22 : 1;
			unsigned long IS23 : 1;
			unsigned long IS24 : 1;
			unsigned long IS25 : 1;
			unsigned long IS26 : 1;
			unsigned long IS27 : 1;
			unsigned long IS28 : 1;
			unsigned long IS29 : 1;
			unsigned long IS30 : 1;
			unsigned long IS31 : 1;
#else
			unsigned long IS31 : 1;
			unsigned long IS30 : 1;
			unsigned long IS29 : 1;
			unsigned long IS28 : 1;
			unsigned long IS27 : 1;
			unsigned long IS26 : 1;
			unsigned long IS25 : 1;
			unsigned long IS24 : 1;
			unsigned long IS23 : 1;
			unsigned long IS22 : 1;
			unsigned long IS21 : 1;
			unsigned long IS20 : 1;
			unsigned long IS19 : 1;
			unsigned long IS18 : 1;
			unsigned long IS17 : 1;
			unsigned long IS16 : 1;
			unsigned long IS15 : 1;
			unsigned long IS14 : 1;
			unsigned long IS13 : 1;
			unsigned long IS12 : 1;
			unsigned long IS11 : 1;
			unsigned long IS10 : 1;
			unsigned long IS9 : 1;
			unsigned long IS8 : 1;
			unsigned long IS7 : 1;
			unsigned long IS6 : 1;
			unsigned long IS5 : 1;
			unsigned long IS4 : 1;
			unsigned long IS3 : 1;
			unsigned long IS2 : 1;
			unsigned long IS1 : 1;
			unsigned long IS0 : 1;
#endif
	} BIT;
	} GRPBL1;
	char           wk19[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENBE0;
	char           wk20[44];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENBL0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long EN6 : 1;
			unsigned long EN7 : 1;
			unsigned long EN8 : 1;
			unsigned long EN9 : 1;
			unsigned long EN10 : 1;
			unsigned long EN11 : 1;
			unsigned long EN12 : 1;
			unsigned long EN13 : 1;
			unsigned long EN14 : 1;
			unsigned long EN15 : 1;
			unsigned long EN16 : 1;
			unsigned long EN17 : 1;
			unsigned long EN18 : 1;
			unsigned long EN19 : 1;
			unsigned long EN20 : 1;
			unsigned long EN21 : 1;
			unsigned long EN22 : 1;
			unsigned long EN23 : 1;
			unsigned long EN24 : 1;
			unsigned long EN25 : 1;
			unsigned long EN26 : 1;
			unsigned long EN27 : 1;
			unsigned long EN28 : 1;
			unsigned long EN29 : 1;
			unsigned long EN30 : 1;
			unsigned long EN31 : 1;
#else
			unsigned long EN31 : 1;
			unsigned long EN30 : 1;
			unsigned long EN29 : 1;
			unsigned long EN28 : 1;
			unsigned long EN27 : 1;
			unsigned long EN26 : 1;
			unsigned long EN25 : 1;
			unsigned long EN24 : 1;
			unsigned long EN23 : 1;
			unsigned long EN22 : 1;
			unsigned long EN21 : 1;
			unsigned long EN20 : 1;
			unsigned long EN19 : 1;
			unsigned long EN18 : 1;
			unsigned long EN17 : 1;
			unsigned long EN16 : 1;
			unsigned long EN15 : 1;
			unsigned long EN14 : 1;
			unsigned long EN13 : 1;
			unsigned long EN12 : 1;
			unsigned long EN11 : 1;
			unsigned long EN10 : 1;
			unsigned long EN9 : 1;
			unsigned long EN8 : 1;
			unsigned long EN7 : 1;
			unsigned long EN6 : 1;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} GENBL1;
	char           wk21[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CLR0 : 1;
			unsigned long CLR1 : 1;
			unsigned long CLR2 : 1;
			unsigned long CLR3 : 1;
			unsigned long CLR4 : 1;
			unsigned long CLR5 : 1;
			unsigned long CLR6 : 1;
			unsigned long CLR7 : 1;
			unsigned long CLR8 : 1;
			unsigned long CLR9 : 1;
			unsigned long CLR10 : 1;
			unsigned long CLR11 : 1;
			unsigned long CLR12 : 1;
			unsigned long CLR13 : 1;
			unsigned long CLR14 : 1;
			unsigned long CLR15 : 1;
			unsigned long CLR16 : 1;
			unsigned long CLR17 : 1;
			unsigned long CLR18 : 1;
			unsigned long CLR19 : 1;
			unsigned long CLR20 : 1;
			unsigned long CLR21 : 1;
			unsigned long CLR22 : 1;
			unsigned long CLR23 : 1;
			unsigned long CLR24 : 1;
			unsigned long CLR25 : 1;
			unsigned long CLR26 : 1;
			unsigned long CLR27 : 1;
			unsigned long CLR28 : 1;
			unsigned long CLR29 : 1;
			unsigned long CLR30 : 1;
			unsigned long CLR31 : 1;
#else
			unsigned long CLR31 : 1;
			unsigned long CLR30 : 1;
			unsigned long CLR29 : 1;
			unsigned long CLR28 : 1;
			unsigned long CLR27 : 1;
			unsigned long CLR26 : 1;
			unsigned long CLR25 : 1;
			unsigned long CLR24 : 1;
			unsigned long CLR23 : 1;
			unsigned long CLR22 : 1;
			unsigned long CLR21 : 1;
			unsigned long CLR20 : 1;
			unsigned long CLR19 : 1;
			unsigned long CLR18 : 1;
			unsigned long CLR17 : 1;
			unsigned long CLR16 : 1;
			unsigned long CLR15 : 1;
			unsigned long CLR14 : 1;
			unsigned long CLR13 : 1;
			unsigned long CLR12 : 1;
			unsigned long CLR11 : 1;
			unsigned long CLR10 : 1;
			unsigned long CLR9 : 1;
			unsigned long CLR8 : 1;
			unsigned long CLR7 : 1;
			unsigned long CLR6 : 1;
			unsigned long CLR5 : 1;
			unsigned long CLR4 : 1;
			unsigned long CLR3 : 1;
			unsigned long CLR2 : 1;
			unsigned long CLR1 : 1;
			unsigned long CLR0 : 1;
#endif
	} BIT;
	} GCRBE0;
	char           wk22[124];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR4;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR5;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR6;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR8;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBR9;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PIR0 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR7 : 1;
#else
			unsigned char PIR7 : 1;
			unsigned char PIR6 : 1;
			unsigned char PIR5 : 1;
			unsigned char PIR4 : 1;
			unsigned char PIR3 : 1;
			unsigned char PIR2 : 1;
			unsigned char PIR1 : 1;
			unsigned char PIR0 : 1;
#endif
	} BIT;
	} PIBRA;
	union {
		unsigned char BYTE;
		struct {
			
