renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx671/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMOIE : 1;
			unsigned char ALIE : 1;
			unsigned char STIE : 1;
			unsigned char SPIE : 1;
			unsigned char NAKIE : 1;
			unsigned char RIE : 1;
			unsigned char TEIE : 1;
			unsigned char TIE : 1;
#else
			unsigned char TIE : 1;
			unsigned char TEIE : 1;
			unsigned char RIE : 1;
			unsigned char NAKIE : 1;
			unsigned char SPIE : 1;
			unsigned char STIE : 1;
			unsigned char ALIE : 1;
			unsigned char TMOIE : 1;
#endif
	} BIT;
	} ICIER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char AAS0 : 1;
			unsigned char AAS1 : 1;
			unsigned char AAS2 : 1;
			unsigned char GCA : 1;
			unsigned char  : 1;
			unsigned char DID : 1;
			unsigned char  : 1;
			unsigned char HOA : 1;
#else
			unsigned char HOA : 1;
			unsigned char  : 1;
			unsigned char DID : 1;
			unsigned char  : 1;
			unsigned char GCA : 1;
			unsigned char AAS2 : 1;
			unsigned char AAS1 : 1;
			unsigned char AAS0 : 1;
#endif
	} BIT;
	} ICSR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMOF : 1;
			unsigned char AL : 1;
			unsigned char START : 1;
			unsigned char STOP : 1;
			unsigned char NACKF : 1;
			unsigned char RDRF : 1;
			unsigned char TEND : 1;
			unsigned char TDRE : 1;
#else
			unsigned char TDRE : 1;
			unsigned char TEND : 1;
			unsigned char RDRF : 1;
			unsigned char NACKF : 1;
			unsigned char STOP : 1;
			unsigned char START : 1;
			unsigned char AL : 1;
			unsigned char TMOF : 1;
#endif
	} BIT;
	} ICSR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SVA0 : 1;
			unsigned char SVA : 7;
#else
			unsigned char SVA : 7;
			unsigned char SVA0 : 1;
#endif
	} BIT;
	} SARL0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FS : 1;
			unsigned char SVA : 2;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SVA : 2;
			unsigned char FS : 1;
#endif
	} BIT;
	} SARU0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SVA0 : 1;
			unsigned char SVA : 7;
#else
			unsigned char SVA : 7;
			unsigned char SVA0 : 1;
#endif
	} BIT;
	} SARL1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FS : 1;
			unsigned char SVA : 2;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SVA : 2;
			unsigned char FS : 1;
#endif
	} BIT;
	} SARU1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SVA0 : 1;
			unsigned char SVA : 7;
#else
			unsigned char SVA : 7;
			unsigned char SVA0 : 1;
#endif
	} BIT;
	} SARL2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FS : 1;
			unsigned char SVA : 2;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SVA : 2;
			unsigned char FS : 1;
#endif
	} BIT;
	} SARU2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BRL : 5;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char BRL : 5;
#endif
	} BIT;
	} ICBRL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BRH : 5;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char BRH : 5;
#endif
	} BIT;
	} ICBRH;
	unsigned char  ICDRT;
	unsigned char  ICDRR;
} st_riic_t;

typedef struct st_riichs {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 31;
			unsigned long ICE : 1;
#else
			unsigned long ICE : 1;
			unsigned long  : 31;
#endif
	} BIT;
	} ICCR;
	char           wk0[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MRST : 1;
			unsigned long  : 15;
			unsigned long ISRST : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long ISRST : 1;
			unsigned long  : 15;
			unsigned long MRST : 1;
#endif
	} BIT;
	} ICRCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 2;
			unsigned long MST : 1;
			unsigned long  : 1;
			unsigned long TRS : 1;
			unsigned long  : 2;
			unsigned long MSWP : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long MSWP : 1;
			unsigned long  : 2;
			unsigned long TRS : 1;
			unsigned long  : 1;
			unsigned long MST : 1;
			unsigned long  : 2;
#endif
	} BIT;
	} ICMMR;
	char           wk1[56];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MALE : 1;
			unsigned long NALE : 1;
			unsigned long SALE : 1;
			unsigned long  : 5;
			unsigned long SCLE : 1;
			unsigned long  : 3;
			unsigned long SMBS : 1;
			unsigned long  : 1;
			unsigned long FMPE : 1;
			unsigned long HSME : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long HSME : 1;
			unsigned long FMPE : 1;
			unsigned long  : 1;
			unsigned long SMBS : 1;
			unsigned long  : 3;
			unsigned long SCLE : 1;
			unsigned long  : 5;
			unsigned long SALE : 1;
			unsigned long NALE : 1;
			unsigned long MALE : 1;
#endif
	} BIT;
	} ICFER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GCAE : 1;
			unsigned long  : 4;
			unsigned long HSMCE : 1;
			unsigned long DIDE : 1;
			unsigned long  : 8;
			unsigned long HOAE : 1;
			unsigned long SAR0E : 1;
			unsigned long SAR1E : 1;
			unsigned long SAR2E : 1;
			unsigned long  : 13;
#else
			unsigned long  : 13;
			unsigned long SAR2E : 1;
			unsigned long SAR1E : 1;
			unsigned long SAR0E : 1;
			unsigned long HOAE : 1;
			unsigned long  : 8;
			unsigned long DIDE : 1;
			unsigned long HSMCE : 1;
			unsigned long  : 4;
			unsigned long GCAE : 1;
#endif
	} BIT;
	} ICSCR;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CKS : 3;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long CKS : 3;
#endif
	} BIT;
	} ICRCCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LOW : 8;
			unsigned long HIGH : 8;
			unsigned long  : 15;
			unsigned long DBL : 1;
#else
			unsigned long DBL : 1;
			unsigned long  : 15;
			unsigned long HIGH : 8;
			unsigned long LOW : 8;
#endif
	} BIT;
	} ICFBR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LOW : 8;
			unsigned long HIGH : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long HIGH : 8;
			unsigned long LOW : 8;
#endif
	} BIT;
	} ICHBR;
	unsigned long  ICBFTR;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SDAO : 1;
			unsigned long SCLO : 1;
			unsigned long SOWP : 1;
			unsigned long  : 1;
			unsigned long CLO : 1;
			unsigned long  : 3;
			unsigned long SDDL : 3;
			unsigned long  : 4;
			unsigned long DLCS : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long DLCS : 1;
			unsigned long  : 4;
			unsigned long SDDL : 3;
			unsigned long  : 3;
			unsigned long CLO : 1;
			unsigned long  : 1;
			unsigned long SOWP : 1;
			unsigned long SCLO : 1;
			unsigned long SDAO : 1;
#endif
	} BIT;
	} ICOCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long NF : 4;
			unsigned long NFE : 1;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long NFE : 1;
			unsigned long NF : 4;
#endif
	} BIT;
	} ICICR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TMOS : 2;
			unsigned long  : 2;
			unsigned long TMOL : 1;
			unsigned long TMOH : 1;
			unsigned long TMOM : 2;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long TMOM : 2;
			unsigned long TMOH : 1;
			unsigned long TMOL : 1;
			unsigned long  : 2;
			unsigned long TMOS : 2;
#endif
	} BIT;
	} ICTOR;
	char           wk4[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ACKBR : 1;
			unsigned long ACKBT : 1;
			unsigned long ACKWP : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long ACKWP : 1;
			unsigned long ACKBT : 1;
			unsigned long ACKBR : 1;
#endif
	} BIT;
	} ICACKR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WAITAE : 1;
			unsigned long WAITRE : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long WAITRE : 1;
			unsigned long WAITAE : 1;
#endif
	} BIT;
	} ICCSCR;
	char           wk5[152];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ST : 1;
			unsigned long RS : 1;
			unsigned long SP : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long SP : 1;
			unsigned long RS : 1;
			unsigned long ST : 1;
#endif
	} BIT;
	} ICCGR;
	char           wk6[20];
	union {
		unsigned long LONG;
		unsigned char BYTE;
	} ICDR;
	char           wk7[116];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long START : 1;
			unsigned long STOP : 1;
			unsigned long  : 2;
			unsigned long NACKF : 1;
			unsigned long  : 3;
			unsigned long TEND : 1;
			unsigned long  : 7;
			unsigned long AL : 1;
			unsigned long  : 3;
			unsigned long TMOF : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TMOF : 1;
			unsigned long  : 3;
			unsigned long AL : 1;
			unsigned long  : 7;
			unsigned long TEND : 1;
			unsigned long  : 3;
			unsigned long NACKF : 1;
			unsigned long  : 2;
			unsigned long STOP : 1;
			unsigned long START : 1;
#endif
	} BIT;
	} ICSR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STDE : 1;
			unsigned long SPDE : 1;
			unsigned long  : 2;
			unsigned long NAKDE : 1;
			unsigned long  : 3;
			unsigned long TEDE : 1;
			unsigned long  : 7;
			unsigned long ALE : 1;
			unsigned long  : 3;
			unsigned long TMOE : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TMOE : 1;
			unsigned long  : 3;
			unsigned long ALE : 1;
			unsigned long  : 7;
			unsigned long TEDE : 1;
			unsigned long  : 3;
			unsigned long NAKDE : 1;
			unsigned long  : 2;
			unsigned long SPDE : 1;
			unsigned long STDE : 1;
#endif
	} BIT;
	} ICSER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STIE : 1;
			unsigned long SPIE : 1;
			unsigned long  : 2;
			unsigned long NAKIE : 1;
			unsigned long  : 3;
			unsigned long TEIE : 1;
			unsigned long  : 7;
			unsigned long ALIE : 1;
			unsigned long  : 3;
			unsigned long TMOIE : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TMOIE : 1;
			unsigned long  : 3;
			unsigned long ALIE : 1;
			unsigned long  : 7;
			unsigned long TEIE : 1;
			unsigned long  : 3;
			unsigned long NAKIE : 1;
			unsigned long  : 2;
			unsigned long SPIE : 1;
			unsigned long STIE : 1;
#endif
	} BIT;
	} ICSIER;
	char           wk8[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDRE : 1;
			unsigned long RDRF : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long RDRF : 1;
			unsigned long TDRE : 1;
#endif
	} BIT;
	} ICCSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDE : 1;
			unsigned long RDE : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long RDE : 1;
			unsigned long TDE : 1;
#endif
	} BIT;
	} ICCSER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TIE : 1;
			unsigned long RIE : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long RIE : 1;
			unsigned long TIE : 1;
#endif
	} BIT;
	} ICCSIER;
	char           wk9[36];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BFREE : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long BFREE : 1;
#endif
	} BIT;
	} ICBSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GCA : 1;
			unsigned long  : 4;
			unsigned long HSMC : 1;
			unsigned long DID : 1;
			unsigned long  : 8;
			unsigned long HOA : 1;
			unsigned long AAS0 : 1;
			unsigned long AAS1 : 1;
			unsigned long AAS2 : 1;
			unsigned long  : 13;
#else
			unsigned long  : 13;
			unsigned long AAS2 : 1;
			unsigned long AAS1 : 1;
			unsigned long AAS0 : 1;
			unsigned long HOA : 1;
			unsigned long  : 8;
			unsigned long DID : 1;
			unsigned long HSMC : 1;
			unsigned long  : 4;
			unsigned long GCA : 1;
#endif
	} BIT;
	} ICSSR;
	char           wk10[152];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SVA : 10;
			unsigned long FS : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long FS : 1;
			unsigned long SVA : 10;
#endif
	} BIT;
	} SAR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SVA : 10;
			unsigned long FS : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long FS : 1;
			unsigned long SVA : 10;
#endif
	} BIT;
	} SAR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SVA : 10;
			unsigned long FS : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long FS : 1;
			unsigned long SVA : 10;
#endif
	} BIT;
	} SAR2;
	char           wk11[116];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long SVA : 10;
			unsigned long  : 1;
			unsigned long FS : 1;
			unsigned long  : 2;
			unsigned long SAV : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long SAV : 1;
			unsigned long  : 2;
			unsigned long FS : 1;
			unsigned long  : 1;
			unsigned long SVA : 10;
			unsigned long  : 16;
#endif
	} BIT;
	} SAMR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long SVA : 10;
			unsigned long  : 1;
			unsigned long FS : 1;
			unsigned long  : 2;
			unsigned long SAV : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long SAV : 1;
			unsigned long  : 2;
			unsigned long FS : 1;
			unsigned long  : 1;
			unsigned long SVA : 10;
			unsigned long  : 16;
#endif
	} BIT;
	} SAMR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long SVA : 10;
			unsigned long  : 1;
			unsigned long FS : 1;
			unsigned long  : 2;
			unsigned long SAV : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long SAV : 1;
			unsigned long  : 2;
			unsigned long FS : 1;
			unsigned long  : 1;
			unsigned long SVA : 10;
			unsigned long  : 16;
#endif
	} BIT;
	} SAMR2;
	char           wk12[68];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BC : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long BC : 5;
#endif
	} BIT;
	} ICBCR;
	char           wk13[72];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SCLI : 1;
			unsigned long SDAI : 1;
			unsigned long SCLO : 1;
			unsigned long SDAO : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long SDAO : 1;
			unsigned long SCLO : 1;
			unsigned long SDAI : 1;
			unsigned long SCLI : 1;
#endif
	} BIT;
	} ICIMR;
} st_riichs_t;

