renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx671/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CPHA : 1;
			unsigned short CPOL : 1;
			unsigned short BRDV : 2;
			unsigned short SSLA : 3;
			unsigned short SSLKP : 1;
			unsigned short SPB : 4;
			unsigned short LSBF : 1;
			unsigned short SPNDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SCKDEN : 1;
#else
			unsigned short SCKDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SPNDEN : 1;
			unsigned short LSBF : 1;
			unsigned short SPB : 4;
			unsigned short SSLKP : 1;
			unsigned short SSLA : 3;
			unsigned short BRDV : 2;
			unsigned short CPOL : 1;
			unsigned short CPHA : 1;
#endif
	} BIT;
	} SPCMD3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CPHA : 1;
			unsigned short CPOL : 1;
			unsigned short BRDV : 2;
			unsigned short SSLA : 3;
			unsigned short SSLKP : 1;
			unsigned short SPB : 4;
			unsigned short LSBF : 1;
			unsigned short SPNDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SCKDEN : 1;
#else
			unsigned short SCKDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SPNDEN : 1;
			unsigned short LSBF : 1;
			unsigned short SPB : 4;
			unsigned short SSLKP : 1;
			unsigned short SSLA : 3;
			unsigned short BRDV : 2;
			unsigned short CPOL : 1;
			unsigned short CPHA : 1;
#endif
	} BIT;
	} SPCMD4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CPHA : 1;
			unsigned short CPOL : 1;
			unsigned short BRDV : 2;
			unsigned short SSLA : 3;
			unsigned short SSLKP : 1;
			unsigned short SPB : 4;
			unsigned short LSBF : 1;
			unsigned short SPNDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SCKDEN : 1;
#else
			unsigned short SCKDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SPNDEN : 1;
			unsigned short LSBF : 1;
			unsigned short SPB : 4;
			unsigned short SSLKP : 1;
			unsigned short SSLA : 3;
			unsigned short BRDV : 2;
			unsigned short CPOL : 1;
			unsigned short CPHA : 1;
#endif
	} BIT;
	} SPCMD5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CPHA : 1;
			unsigned short CPOL : 1;
			unsigned short BRDV : 2;
			unsigned short SSLA : 3;
			unsigned short SSLKP : 1;
			unsigned short SPB : 4;
			unsigned short LSBF : 1;
			unsigned short SPNDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SCKDEN : 1;
#else
			unsigned short SCKDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SPNDEN : 1;
			unsigned short LSBF : 1;
			unsigned short SPB : 4;
			unsigned short SSLKP : 1;
			unsigned short SSLA : 3;
			unsigned short BRDV : 2;
			unsigned short CPOL : 1;
			unsigned short CPHA : 1;
#endif
	} BIT;
	} SPCMD6;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CPHA : 1;
			unsigned short CPOL : 1;
			unsigned short BRDV : 2;
			unsigned short SSLA : 3;
			unsigned short SSLKP : 1;
			unsigned short SPB : 4;
			unsigned short LSBF : 1;
			unsigned short SPNDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SCKDEN : 1;
#else
			unsigned short SCKDEN : 1;
			unsigned short SLNDEN : 1;
			unsigned short SPNDEN : 1;
			unsigned short LSBF : 1;
			unsigned short SPB : 4;
			unsigned short SSLKP : 1;
			unsigned short SSLA : 3;
			unsigned short BRDV : 2;
			unsigned short CPOL : 1;
			unsigned short CPHA : 1;
#endif
	} BIT;
	} SPCMD7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BYSW : 1;
			unsigned char DINV : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char DINV : 1;
			unsigned char BYSW : 1;
#endif
	} BIT;
	} SPDCR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RXMD : 1;
			unsigned char SCKDDIS : 1;
			unsigned char  : 2;
			unsigned char SPCIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char SPCIE : 1;
			unsigned char  : 2;
			unsigned char SCKDDIS : 1;
			unsigned char RXMD : 1;
#endif
	} BIT;
	} SPCR3;
} st_rspi_t;

typedef struct st_rspia {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
		} WORD;
		struct {
			unsigned char LL;
		} BYTE;
	} SPDR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SCKDL : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SCKDL : 3;
#endif
	} BIT;
	} SPCKD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SLNDL : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SLNDL : 3;
#endif
	} BIT;
	} SSLND;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SPNDL : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SPNDL : 3;
#endif
	} BIT;
	} SPND;
	char           wk0[1];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SPE : 1;
			unsigned long  : 7;
			unsigned long SPPE : 1;
			unsigned long SPOE : 1;
			unsigned long  : 1;
			unsigned long PTE : 1;
			unsigned long SCKASE : 1;
			unsigned long SCKDDIS : 1;
			unsigned long MODFEN : 1;
			unsigned long  : 1;
			unsigned long SPEIE : 1;
			unsigned long SPRIE : 1;
			unsigned long SPIIE : 1;
			unsigned long RDRIS : 1;
			unsigned long SPTIE : 1;
			unsigned long SPCIE : 1;
			unsigned long  : 2;
			unsigned long SPMS : 1;
			unsigned long FRFS : 1;
			unsigned long  : 2;
			unsigned long CMMD : 2;
			unsigned long MSTR : 1;
			unsigned long SYNDIS : 1;
#else
			unsigned long SYNDIS : 1;
			unsigned long MSTR : 1;
			unsigned long CMMD : 2;
			unsigned long  : 2;
			unsigned long FRFS : 1;
			unsigned long SPMS : 1;
			unsigned long  : 2;
			unsigned long SPCIE : 1;
			unsigned long SPTIE : 1;
			unsigned long RDRIS : 1;
			unsigned long SPIIE : 1;
			unsigned long SPRIE : 1;
			unsigned long SPEIE : 1;
			unsigned long  : 1;
			unsigned long MODFEN : 1;
			unsigned long SCKDDIS : 1;
			unsigned long SCKASE : 1;
			unsigned long PTE : 1;
			unsigned long  : 1;
			unsigned long SPOE : 1;
			unsigned long SPPE : 1;
			unsigned long  : 7;
			unsigned long SPE : 1;
#endif
	} BIT;
	} SPCR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RFC : 5;
			unsigned char  : 1;
			unsigned char TERM : 1;
			unsigned char START : 1;
#else
			unsigned char START : 1;
			unsigned char TERM : 1;
			unsigned char  : 1;
			unsigned char RFC : 5;
#endif
	} BIT;
	} SPRMCR;
	unsigned char  SPDRCSR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SPLP : 1;
			unsigned char SPLP2 : 1;
			unsigned char  : 2;
			unsigned char MOIFV : 1;
			unsigned char MOIFE : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char MOIFE : 1;
			unsigned char MOIFV : 1;
			unsigned char  : 2;
			unsigned char SPLP2 : 1;
			unsigned char SPLP : 1;
#endif
	} BIT;
	} SPPCR;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SSL0P : 1;
			unsigned char SSL1P : 1;
			unsigned char SSL2P : 1;
			unsigned char SSL3P : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char SSL3P : 1;
			unsigned char SSL2P : 1;
			unsigned char SSL1P : 1;
			unsigned char SSL0P : 1;
#endif
	} BIT;
	} SSLP;
	unsigned char  SPBR;
	char           wk2[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SPSLN : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SPSLN : 3;
#endif
	} BIT;
	} SPSCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long BRDV : 2;
			unsigned long  : 3;
			unsigned long SSLKP : 1;
			unsigned long  : 4;
			unsigned long LSBF : 1;
			unsigned long SPNDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SCKDEN : 1;
			unsigned long SPB : 5;
			unsigned long  : 3;
			unsigned long SSLA : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SSLA : 3;
			unsigned long  : 3;
			unsigned long SPB : 5;
			unsigned long SCKDEN : 1;
			unsigned long SLNDEN : 1;
			unsigned long SPNDEN : 1;
			unsigned long LSBF : 1;
			unsigned long  : 4;
			unsigned long SSLKP : 1;
			unsigned long  : 3;
			unsigned long BRDV : 2;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SPCMD7;
	char           wk3[12];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short BYSW : 1;
			unsigned short  : 2;
			unsigned short SPRDTD : 1;
			unsigned short DINV : 1;
			unsigned short  : 3;
			unsigned short SPFC : 2;
			unsigned short  : 6;
#else
			unsigned short  : 6;
			unsigned short SPFC : 2;
			unsigned short  : 3;
			unsigned short DINV : 1;
			unsigned short SPRDTD : 1;
			unsigned short  : 2;
			unsigned short BYSW : 1;
#endif
	} BIT;
	} SPDCR;
	char           wk4[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RTRG : 2;
			unsigned short  : 6;
			unsigned short TTRG : 2;
			unsigned short  : 6;
#else
			unsigned short  : 6;
			unsigned short TTRG : 2;
			unsigned short  : 6;
			unsigned short RTRG : 2;
#endif
	} BIT;
	} SPFCR;
	char           wk5[11];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SPCP : 3;
			unsigned char  : 1;
			unsigned char SPECM : 3;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char SPECM : 3;
			unsigned char  : 1;
			unsigned char SPCP : 3;
#endif
	} BIT;
	} SPSSR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 7;
			unsigned short RRDYF : 1;
			unsigned short OVRF : 1;
			unsigned short IDLNF : 1;
			unsigned short MODF : 1;
			unsigned short PERF : 1;
			unsigned short UDRF : 1;
			unsigned short SPTEF : 1;
			unsigned short SPCF : 1;
			unsigned short SPRF : 1;
#else
			unsigned short SPRF : 1;
			unsigned short SPCF : 1;
			unsigned short SPTEF : 1;
			unsigned short UDRF : 1;
			unsigned short PERF : 1;
			unsigned short MODF : 1;
			unsigned short IDLNF : 1;
			unsigned short OVRF : 1;
			unsigned short RRDYF : 1;
			unsigned short  : 7;
#endif
	} BIT;
	} SPSR;
	char           wk6[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FREE : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char FREE : 3;
#endif
	} BIT;
	} SPTFSR;
	char           wk7[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FILL : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char FILL : 3;
#endif
	} BIT;
	} SPRFSR;
	char           wk8[13];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 7;
			unsigned short RRDYFC : 1;
			unsigned short OVRFC : 1;
			unsigned short  : 1;
			unsigned short MODFC : 1;
			unsigned short PERFC : 1;
			unsigned short UDRFC : 1;
			unsigned short SPTEFC : 1;
			unsigned short SPCFC : 1;
			unsigned short SPRFC : 1;
#else
			unsigned short SPRFC : 1;
			unsigned short SPCFC : 1;
			unsigned short SPTEFC : 1;
			unsigned short UDRFC : 1;
			unsigned short PERFC : 1;
			unsigned short MODFC : 1;
			unsigned short  : 1;
			unsigned short OVRFC : 1;
			unsigned short RRDYFC : 1;
			unsigned short  : 7;
#endif
	} BIT;
	} SPSCLR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FCLR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char FCLR : 1;
#endif
	} BIT;
	} SPFCLR;
} st_rspia_t;

typedef struct st_rtc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char F64HZ : 1;
			unsigned char F32HZ : 1;
			unsigned char F16HZ : 1;
			unsigned char F8HZ : 1;
			unsigned char F4HZ : 1;
			unsigned char F2HZ : 1;
			unsigned char F1HZ : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char F1HZ : 1;
			unsigned char F2HZ : 1;
			unsigned char F4HZ : 1;
			unsigned char F8HZ : 1;
			unsigned char F16HZ : 1;
			unsigned char F32HZ : 1;
			unsigned char F64HZ : 1;
#endif
	} BIT;
	} R64CNT;
	char           wk0[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SEC1 : 4;
			unsigned char SEC10 : 3;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char SEC10 : 3;
			unsigned char SEC1 : 4;
#endif
	} BIT;
		} RSECCNT;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNT : 8;
#else
			unsigned char BCNT : 8;
#endif
	} BIT;
		} BCNT0;
	};
	char           wk1[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MIN1 : 4;
			unsigned char MIN10 : 3;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char MIN10 : 3;
			unsigned char MIN1 : 4;
#endif
	} BIT;
		} RMINCNT;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNT : 8;
#else
			unsigned char BCNT : 8;
#endif
	} BIT;
		} BCNT1;
	};
	char           wk2[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char HR1 : 4;
			unsigned char HR10 : 2;
			unsigned char PM : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char PM : 1;
			unsigned char HR10 : 2;
			unsigned char HR1 : 4;
#endif
	} BIT;
		} RHRCNT;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNT : 8;
#else
			unsigned char BCNT : 8;
#endif
	} BIT;
		} BCNT2;
	};
	char           wk3[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DAYW : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char DAYW : 3;
#endif
	} BIT;
		} RWKCNT;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNT : 8;
#else
			unsigned char BCNT : 8;
#endif
	} BIT;
		} BCNT3;
	};
	char           wk4[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DATE1 : 4;
			unsigned char DATE10 : 2;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char DATE10 : 2;
			unsigned char DATE1 : 4;
#endif
	} BIT;
	} RDAYCNT;
	char           wk5[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MON1 : 4;
			unsigned char MON10 : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char MON10 : 1;
			unsigned char MON1 : 4;
#endif
	} BIT;
	} RMONCNT;
	char           wk6[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short YR1 : 4;
			unsigned short YR10 : 4;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short YR10 : 4;
			unsigned short YR1 : 4;
#endif
	} BIT;
	} RYRCNT;
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SEC1 : 4;
			unsigned char SEC10 : 3;
			unsigned char ENB : 1;
#else
			unsigned char ENB : 1;
			unsigned char SEC10 : 3;
			unsigned char SEC1 : 4;
#endif
	} BIT;
		} RSECAR;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNTAR : 8;
#else
			unsigned char BCNTAR : 8;
#endif
	} BIT;
		} BCNT0AR;
	};
	char           wk7[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MIN1 : 4;
			unsigned char MIN10 : 3;
			unsigned char ENB : 1;
#else
			unsigned char ENB : 1;
			unsigned char MIN10 : 3;
			unsigned char MIN1 : 4;
#endif
	} BIT;
		} RMINAR;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNTAR : 8;
#else
			unsigned char BCNTAR : 8;
#endif
	} BIT;
		} BCNT1AR;
	};
	char           wk8[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char HR1 : 4;
			unsigned char HR10 : 2;
			unsigned char PM : 1;
			unsigned char ENB : 1;
#else
			unsigned char ENB : 1;
			unsigned char PM : 1;
			unsigned char HR10 : 2;
			unsigned char HR1 : 4;
#endif
	} BIT;
		} RHRAR;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNTAR : 8;
#else
			unsigned char BCNTAR : 8;
#endif
	} BIT;
		} BCNT2AR;
	};
	char           wk9[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DAYW : 3;
			unsigned char  : 4;
			unsigned char ENB : 1;
#else
			unsigned char ENB : 1;
			unsigned char  : 4;
			unsigned char DAYW : 3;
#endif
	} BIT;
		} RWKAR;
		union {
			unsigned char BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCNTAR : 8;
#else
			unsigned char BCNTAR : 8;
#endif
	} BIT;
		} BCNT3AR;
	};
	char           wk10[1];
	union {
		union {
			unsigned char BYTE;
			struct {
				
